api/app/controllers/api/v1/records_controller.rb

  def create
    @record = Record.new(record_params)
    if @record.save
---
INSERT INTO `records` (`user_id`, `record_date`, `temperature`, `weight`, `note`, `is_period_start`, `is_period_end`, `is_discharge`, `is_spotting`, `is_taking_pill`, `created_at`, `updated_at`) VALUES (1, '2024-11-03', NULL, 50.0, '', FALSE, FALSE, FALSE, FALSE, FALSE, '2024-11-10 20:59:09.317184', '2024-11-10 20:59:09.317184')

  def set_record
    @record = Record.find(params[:id])
---
SELECT `records`.* FROM `records` WHERE `records`.`id` = 2024 LIMIT 1