api/app/controllers/api/v1/records_controller.rb

  def index
    @records = Record.all
---
SELECT `records`.* FROM `records`

  def create_or_update
    # レコードの存在確認
    record = Record.find_by(user_id: record_params[:user_id], record_date: record_params[:record_date])

    if record
      # レコードが存在する場合は更新
      if record.update(record_params)
---
SELECT `records`.* FROM `records` WHERE `records`.`user_id` = 1 AND `records`.`record_date` = '2024-11-11' LIMIT 1
UPDATE `records` SET `records`.`is_spotting` = TRUE, `records`.`updated_at` = '2024-11-10 08:07:10.624696' WHERE `records`.`id` = 3

  def show_by_date
    @record = Record.find_by(record_date: params[:record_date], user_id: params[:user_id])
---
SELECT `records`.* FROM `records` WHERE `records`.`record_date` IS NULL AND `records`.`user_id` IS NULL LIMIT 1

  def set_record
    if params[:record_date].present? && params[:user_id].present?
      @record = Record.find_by!(record_date: params[:record_date], user_id: params[:user_id])
---
SELECT `records`.* FROM `records` WHERE `records`.`user_id` = 1 AND `records`.`record_date` = '2024-11-11' LIMIT 1